[
  {
    "id": 1,
    "title": "Site web et internat de Bahy",
    "client": "Bahy",
    "date": "2023-2024",
    "projectUrl": "https://bahy.fr/",
    "role": "Alternant développeur web full-stack",
    "technologies": ["Figma", "React", "Node.js", "Firebase"],
    "description": "En alternance, j'ai développé la plateforme Bahy, enrichissant l'interaction utilisateur avec de nouvelles fonctionnalités, y compris un système de découverte et candidature à des offres, améliorant ainsi l'expérience globale.",
    "introduction": "Au sein de mon alternance, j'ai contribué au projet de transformation numérique de Bahy, une plateforme novatrice conçue pour renforcer les liens entre intervenants et écoles de formation. Mon rôle était de concevoir et développer une solution en ligne permettant d'améliorer l'interaction entre les parties prenantes grâce à des fonctionnalités avancées, facilitant ainsi la découverte et la candidature à des offres de formation. En parallèle, j'ai également été chargé de créer un intranet complet pour Bahy, afin d'optimiser la gestion interne, la communication, et l'analyse de données, assurant une gestion fluide et efficace des opérations quotidiennes.",
    "needs": "<ul><li><h3>Adoption de la Plateforme</h3><br/> Assurer une adoption rapide et efficace de la plateforme par les utilisateurs ciblés, nécessitant une interface intuitive et des fonctionnalités répondant précisément à leurs besoins.</li><br/><li><h3>Sécurité et Confidentialité </h3><br/> Garantir la sécurité des données et la confidentialité des informations échangées entre tous les acteurs impliqués.</li><br/><li><h3>Intégration de Fonctionnalités Avancées </h3><br/> Incorporer des solutions technologiques innovantes pour soutenir les fonctionnalités complexes de la plateforme et de l'intranet, tout en maintenant une performance optimale.</li><br/><li><h3>Développement d'un Tableau de Bord pour les Intervenants </h3><br/> Offrir aux intervenants un tableau de bord personnalisé permettant un suivi précis de leurs candidatures, formations et accès à des statistiques détaillées, afin de maximiser leur engagement et leur satisfaction.</li></ul>",
    "solutions": "<ul><li><h3>Conception UX/UI</h3><br/> Une interface utilisateur épurée et réactive a été développée pour faciliter la navigation et améliorer l'expérience utilisateur, tant pour les intervenants que pour les écoles de formation.</li><br/><li><h3>Plateforme de Candidature </h3><br/> Un système simplifié permettant aux utilisateurs de découvrir facilement les offres de formation et de postuler en quelques clics a été intégré, visant à rendre le processus plus accessible et efficace.</li><br/><li><h3>Intranet Complet </h3><br/> Un intranet a été mis en place pour Bahy, offrant des fonctionnalités de gestion de contenu, suivi des intervenants, accès à des documents importants, et visualisation de statistiques détaillées, facilitant ainsi la prise de décision éclairée.</li><br/><li><h3>Tableau de Bord pour les Intervenants </h3><br/> Une attention particulière a été accordée au développement d'un tableau de bord personnalisé pour les intervenants. Ce tableau de bord offre un accès immédiat à des informations clés, telles que les opportunités de formation, les candidatures en cours, ainsi que des analyses et des statistiques personnalisées. L'objectif était de fournir aux intervenants les outils nécessaires pour gérer efficacement leurs candidatures et interactions avec les écoles, améliorant ainsi leur expérience globale sur la plateforme.</li></ul>",
    "challenges": "<ul><li><h3>Adoption de la Plateforme</h3><br/> Assurer une adoption rapide et efficace par les utilisateurs ciblés, avec une interface intuitive et des fonctionnalités répondant précisément à leurs attentes.</li><br/><li><h3>Sécurité et Confidentialité </h3><br/> Garantir la sécurité des données et la confidentialité des informations échangées entre tous les acteurs impliqués.</li><br/><li><h3>Intégration de Fonctionnalités Avancées </h3><br/> Incorporer des solutions technologiques de pointe pour soutenir les fonctionnalités complexes de la plateforme et de l'intranet, en veillant à maintenir une performance optimale.</li></ul>",
    "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2Fbahy%2Fbahy_img_33.png?alt=media&token=5abf22ac-778b-420a-822a-272a64c081bb",
    "img_1": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2Fbahy%2Fbahy_img_6.jpg?alt=media&token=a49b3388-3c00-4d22-b782-21802d83d1d0",
    "img_2": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2Fbahy%2Fsmartmockups_lur22h5t.jpg?alt=media&token=9637c255-8e53-42d6-8e85-5bcbd27531fb",
    "img_3": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2Fbahy%2Fsmartmockups_lur28b9h.jpg?alt=media&token=00c3e1f2-4ed4-42c4-9c02-fdaa34f741c8"
  },
  {
    "id": 2,
    "title": "E-Prepa plateforme d'E-Learning",
    "client": "Bahy",
    "date": "2023-2024",
    "role": "Alternant développeur web full-stack",
    "technologies": ["Figma", "React", "Php", "Firebase", "Stripe"],
    "description": "Durant mon alternance, j'ai développé E-Prepa, une plateforme d'e-learning pour les diplômes de DCG et DSCG, offrant flexibilité et ressources de qualité pour réussir professionnellement.",
    "introduction": "Identifiant le besoin d'accès à une formation de qualité et flexible pour les étudiants et professionnels aspirant à obtenir les diplômes de DCG et DSCG, j'ai développé E-Prepa. Cette initiative a été motivée par la volonté de briser les barrières traditionnelles de l'éducation et d'offrir une plateforme où l'apprentissage peut être à la fois accessible et adaptatif. Mon rôle a été crucial dans la conception, le développement et le déploiement de cette plateforme en ligne, en intégrant des outils et des ressources innovants pour enrichir l'expérience d'apprentissage.",
    "needs": "<ul><li><h3>Accessibilité et Flexibilité</h3><br/>Offrir une solution d'apprentissage qui s'adapte aux horaires chargés des étudiants et professionnels, permettant un accès en tout temps et en tout lieu.</li><br/><li><h3>Qualité des Ressources Pédagogiques</h3><br/>Garantir la disponibilité de contenus pédagogiques de haute qualité, conçus par des experts dans les domaines du DCG et du DSCG.</li><br/><li><h3>Engagement et Rétention des Apprenants</h3><br/>Créer une expérience utilisateur engageante pour favoriser la motivation et la rétention des apprenants.</li><br/><li><h3>Évaluation et Suivi des Progrès</h3><br/>Intégrer des mécanismes d'évaluation et de suivi permettant aux apprenants de mesurer leur progression.</li></ul>",
    "solutions": "<ul><li><h3>Plateforme E-Learning Adaptative</h3><br/>Développement d'une interface utilisateur intuitive offrant un accès facile à une vaste bibliothèque de ressources éducatives, de cours interactifs et de simulations d'examen.</li><br/><li><h3>Contenu de Haute Qualité</h3><br/>Collaboration avec des experts du domaine pour la création et la validation de tout le contenu pédagogique, assurant ainsi sa pertinence et sa qualité.</li><br/><li><h3>Outils d'Engagement Interactifs</h3><br/>Intégration de fonctionnalités interactives telles que des quiz, des forums de discussion et des sessions de révision en direct pour augmenter l'engagement des apprenants.</li><br/><li><h3>Système de Suivi Personnalisé</h3><br/>Mise en place d'un tableau de bord personnalisé pour chaque apprenant, permettant un suivi détaillé des progrès et l'identification des zones à améliorer.</li></ul>",
    "challenges": "<ul><li><h3>Assurer l'Accessibilité sur Tous les Appareils</h3><br/>Développer une plateforme réactive qui est accessible et performante sur tous les types d'appareils, des ordinateurs de bureau aux smartphones.</li><br/><li><h3>Maintenir la Qualité du Contenu</h3><br/>Gérer le défi de maintenir un niveau élevé de qualité pour l'ensemble du contenu pédagogique face à l'évolution constante des standards académiques et professionnels.</li><br/><li><h3>Maximiser l'Engagement des Utilisateurs</h3><br/>Créer des stratégies efficaces pour encourager l'interaction continue des utilisateurs avec la plateforme et éviter l'abandon des cours.</li></ul>",
    "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F3%2Fimage.png?alt=media&token=03e8bce6-55a5-4c83-bcd4-d2a47421ed83",
    "img_1": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F3%2Fimg_1.jpg?alt=media&token=5c54f367-35e4-4db2-9500-53874e6b9ec2",
    "img_2": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F3%2Fimg_2.jpg?alt=media&token=c55b99d8-1a98-4ab6-8af7-82a7e7910771",
    "img_3": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F3%2Fimg_3.jpg?alt=media&token=51a414e9-59da-47f5-96ff-b9d819e25ab8"
  },
  {
    "id": 3,
    "title": "Nysa",
    "client": "Nysa",
    "date": "2023-2024",
    "role": "Développeur web full-stack",
    "technologies": [
      "Figma",
      "React native",
      "Node js",
      "MongoDB",
      "GraphQl",
      "Firebase",
      "Stripe"
    ],
    "description": "En freelance, j'ai créé Nysa, une app mobile pour explorer facilement des événements mondiaux, améliorant l'accès à des expériences culturelles et sociales locales et internationales pour les utilisateurs.",
    "introduction": "L'initiative Nysa est née de la volonté du client de connecter les personnes avec les événements autour d'elles, en facilitant la découverte et l'accès à des événements variés, des concerts locaux aux festivals internationaux. En tant que concepteur et développeur, mon objectif était de créer une application mobile qui non seulement met en lumière les événements de toutes sortes mais offre également une expérience utilisateur fluide et engageante.",
    "needs": "<ul><li><h3>Accessibilité et Découverte</h3><br/> Permettre une découverte aisée des événements par les utilisateurs, grâce à une interface claire et des fonctionnalités de recherche avancées.</li><br/><li><h3>Expérience Utilisateur Intuitive</h3><br/> Fournir une expérience utilisateur sans faille, avec des interactions fluides et une navigation intuitive.</li><br/><li><h3>Intégration Sociale</h3><br/> Faciliter le partage et la participation à des événements entre amis, renforçant ainsi les liens sociaux.</li><br/><li><h3>Mise à Jour en Temps Réel</h3><br/> Assurer la mise à jour continue des informations d'événements pour offrir des données précises et à jour.</li></ul>",
    "solutions": "<ul><li><h3>Design UX/UI Moderne</h3><br/> Une conception UX/UI attrayante et moderne a été développée pour faciliter la navigation et rendre la découverte d'événements plus agréable.</li><br/><li><h3>Système de Recherche Avancée</h3><br/> Implémentation d'un système de recherche robuste permettant aux utilisateurs de filtrer les événements selon divers critères, tels que la localisation, le type d'événement, et la date.</li><br/><li><h3>Intégration des Fonctionnalités Sociales</h3><br/> Ajout de fonctionnalités sociales pour permettre aux utilisateurs de partager des événements avec leurs amis et de voir quels événements intéressent leur réseau.</li><br/><li><h3>Notifications et Mises à Jour</h3><br/> Mise en place d'un système de notifications pour informer les utilisateurs des nouveaux événements et des mises à jour importantes concernant leurs événements favoris.</li></ul>",
    "challenges": "<ul><li><h3>Création d'une Base de Données Complète</h3><br/> Compiler une base de données exhaustive d'événements nécessitant une collaboration étroite avec des organisateurs d'événements locaux et internationaux.</li><br/><li><h3>Optimisation de la Performance</h3><br/> Garantir une performance fluide de l'application malgré l'intégration de nombreuses fonctionnalités et un grand volume de données.</li><br/><li><h3>Engagement des Utilisateurs</h3><br/> Développer des stratégies pour encourager l'engagement des utilisateurs et promouvoir l'interaction sociale au sein de l'application.</li></ul>",
    "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F2%2Fimage.png?alt=media&token=94359704-fd92-4574-80dd-77485ccdff4d",
    "img_1": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F2%2Fimg_1.jpg?alt=media&token=f890f59a-85a6-4302-b583-69fe25271fba",
    "img_2": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F2%2Fimg_2.jpg?alt=media&token=89a39c3d-bb39-47d3-a798-a771ec895c40",
    "img_3": "https://firebasestorage.googleapis.com/v0/b/portfolio-d62aa.appspot.com/o/projects%2F2%2Fimg_3.jpg?alt=media&token=f68f6b08-7bc4-4b3d-bb6b-8510eebe1194"
  }
]
