[
  {
    "id": 1,
    "title": "E-prepa",
    "description": "Durant mon alternance, j'ai développé E-Prepa, une plateforme d'e-learning spécialisée dans la vente de formations DCG et DSCG. Elle offre un accès flexible à des ressources pédagogiques de qualité pour les étudiants et professionnels.",
    "image": "../assets/img/project.webp"
  },
  {
    "id": 2,
    "title": "Site web et internat de Bahy",
    "description": "Durant mon alternance, j'ai œuvré sur le développement de la nouvelle plateforme en ligne pour Bahy, améliorant l'interaction avec les intervenants grâce à des fonctionnalités novatrices. Ce projet incluait l'intégration d'un système de découverte et de candidature à des offres.",
    "introduction": "Au sein de mon alternance, j'ai contribué au projet de transformation numérique de Bahy, une plateforme novatrice conçue pour renforcer les liens entre intervenants et écoles de formation. Mon rôle était de concevoir et développer une solution en ligne permettant d'améliorer l'interaction entre les parties prenantes grâce à des fonctionnalités avancées, facilitant ainsi la découverte et la candidature à des offres de formation. En parallèle, j'ai également été chargé de créer un intranet complet pour Bahy, afin d'optimiser la gestion interne, la communication, et l'analyse de données, assurant une gestion fluide et efficace des opérations quotidiennes.",
    "needs": "<ul><li><h3>Adoption de la Plateforme</h3><br/> Assurer une adoption rapide et efficace de la plateforme par les utilisateurs ciblés, nécessitant une interface intuitive et des fonctionnalités répondant précisément à leurs besoins.</li><br/><li><h3>Sécurité et Confidentialité </h3><br/> Garantir la sécurité des données et la confidentialité des informations échangées entre tous les acteurs impliqués.</li><br/><li><h3>Intégration de Fonctionnalités Avancées </h3><br/> Incorporer des solutions technologiques innovantes pour soutenir les fonctionnalités complexes de la plateforme et de l'intranet, tout en maintenant une performance optimale.</li><br/><li><h3>Développement d'un Tableau de Bord pour les Intervenants </h3><br/> Offrir aux intervenants un tableau de bord personnalisé permettant un suivi précis de leurs candidatures, formations et accès à des statistiques détaillées, afin de maximiser leur engagement et leur satisfaction.</li></ul>",
    "solutions": "<ul><li><h3>Conception UX/UI</h3><br/> Une interface utilisateur épurée et réactive a été développée pour faciliter la navigation et améliorer l'expérience utilisateur, tant pour les intervenants que pour les écoles de formation.</li><br/><li><h3>Plateforme de Candidature </h3><br/> Un système simplifié permettant aux utilisateurs de découvrir facilement les offres de formation et de postuler en quelques clics a été intégré, visant à rendre le processus plus accessible et efficace.</li><br/><li><h3>Intranet Complet </h3><br/> Un intranet a été mis en place pour Bahy, offrant des fonctionnalités de gestion de contenu, suivi des intervenants, accès à des documents importants, et visualisation de statistiques détaillées, facilitant ainsi la prise de décision éclairée.</li><br/><li><h3>Tableau de Bord pour les Intervenants </h3><br/> Une attention particulière a été accordée au développement d'un tableau de bord personnalisé pour les intervenants. Ce tableau de bord offre un accès immédiat à des informations clés, telles que les opportunités de formation, les candidatures en cours, ainsi que des analyses et des statistiques personnalisées. L'objectif était de fournir aux intervenants les outils nécessaires pour gérer efficacement leurs candidatures et interactions avec les écoles, améliorant ainsi leur expérience globale sur la plateforme.</li></ul>",
    "challenges": "<ul><li><h3>Adoption de la Plateforme</h3><br/> Assurer une adoption rapide et efficace par les utilisateurs ciblés, avec une interface intuitive et des fonctionnalités répondant précisément à leurs attentes.</li><br/><li><h3>Sécurité et Confidentialité </h3><br/> Garantir la sécurité des données et la confidentialité des informations échangées entre tous les acteurs impliqués.</li><br/><li><h3>Intégration de Fonctionnalités Avancées </h3><br/> Incorporer des solutions technologiques de pointe pour soutenir les fonctionnalités complexes de la plateforme et de l'intranet, en veillant à maintenir une performance optimale.</li></ul>",
    "image": "../assets/img/project.webp"
  },
  {
    "id": 3,
    "title": "Nysa",
    "description": "En freelance, j'ai conçu Nysa, une application mobile dédiée au référencement d'événements. Cette plateforme permet aux utilisateurs de découvrir facilement des événements locaux et internationaux, offrant une interface intuitive pour une expérience utilisateur optimale.",
    "image": "../assets/img/project.webp"
  }
]
